<a href="https://colab.research.google.com/github/chaima-mehri/DataScience_TP/blob/main/BD_SQLlTE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
#lecture de données à partir d'une base de données sql
import sqlite3
#Connexion à la base et ajout de table et de données
#créer une base de données avec SQLite
conn=sqlite3.connect('testTP.db')

In [ ]:
cursor = conn.cursor()
cursor.execute('''CREATE TABLE  users
               ( id INTEGER PRIMARY KEY , name TEXT, age INTEGER)''')
conn.commit()

In [ ]:
cursor.execute('INSERT INTO users(name, age) VALUES(?, ?)', ("Akram", 23))

In [ ]:
#Insérer des données par un dictionnaire
data = {"name" : "hamdi", "age" : 24}
cursor.execute("""INSERT INTO users(name, age) VALUES(:name, :age)""", data)

In [ ]:
conn.execute('''insert into users values (101,'Ali ben salah',22)''')

In [ ]:
#Afficher les données
cursor.execute('SELECT id, name, age FROM users')
rt=cursor.fetchall()
print(rt)

[(1, 'Akram', 23), (2, 'hamdi', 24), (101, 'Ali ben salah', 22)]

In [ ]:
df7=pd.read_sql_query("SELECT id, name, age FROM users",conn)
df7

    id           name  age
0    1          Akram   23
1    2          hamdi   24
2  101  Ali ben salah   22